---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.UnableToTransformElement
source: html/2f9290d2-e879-2e12-bfbf-ffd054c7364f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.UnableToTransformElement Property

Attempted an invalid element rotate, mirror, or move.

## Syntax (C#)
```csharp
public static FailureDefinitionId UnableToTransformElement { get; }
```